Revit 2027 API
DuctSettings.IsNetworkBasedCalculationsEnabled Method
 Indicates whether network based calculations for duct networks is enabled in the specified document.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsNetworkBasedCalculationsEnabled(
	Document document
)
Public Shared Function IsNetworkBasedCalculationsEnabled (
	document As Document
) As Boolean
public:
static bool IsNetworkBasedCalculationsEnabled(
	Document^ document
)
static member IsNetworkBasedCalculationsEnabled :
        document : Document -> bool
Parameters
document Document
 The document.
Return Value
Boolean
 Returns true if network based calculations for duct networks is enabled, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DuctSettings Class
Autodesk.Revit.DB.Mechanical Namespace